zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxa/pinctrl/MCXA146VFT-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXA146VFT/signal_configuration.xml
 *
 * 
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MCXA153VFM-pinctrl.h with this part's differences applied
 * below (10 removed, 0 changed,
 * 170 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: d61c6eaf169ed581
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXA146VFT_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MCXA146VFT_WRAPPER_

#include "MCXA153VFM-pinctrl.h"

/* Signals not present on this part */
#undef ADC0_A14_P3_29
#undef ADC0_A2_P2_3
#undef LPI2C0_SCLS_P1_3
#undef LPI2C0_SCL_P1_1
#undef LPI2C0_SCL_P1_9
#undef LPI2C0_SCL_P3_27
#undef LPI2C0_SDAS_P1_2
#undef LPI2C0_SDA_P1_0
#undef LPI2C0_SDA_P1_8
#undef LPI2C0_SDA_P3_28

/* Signals specific to this part */
#define ADC0_A0_P2_0 A15X_MUX('2',0,0)
#define ADC0_A14_P0_3 A15X_MUX('0',3,0)
#define ADC0_A15_P0_6 A15X_MUX('0',6,0)
#define ADC0_A1_P2_1 A15X_MUX('2',1,0)
#define ADC0_A2_P2_15 A15X_MUX('2',15,0)
#define ADC1_A20_P3_31 A15X_MUX('3',31,0)
#define ADC1_A21_P3_30 A15X_MUX('3',30,0)
#define ADC1_A22_P3_29 A15X_MUX('3',29,0)
#define ADC1_A3_P2_6 A15X_MUX('2',6,0)
#define ADC1_A4_P2_3 A15X_MUX('2',3,0)
#define ADC1_A5_P2_13 A15X_MUX('2',13,0)
#define ADC1_A7_P2_7 A15X_MUX('2',7,0)
#define ADC1_A8_P1_10 A15X_MUX('1',10,0)
#define ADC1_A9_P1_11 A15X_MUX('1',11,0)
#define CAN0_RXD_P1_11 A15X_MUX('1',11,11)
#define CAN0_RXD_P1_3 A15X_MUX('1',3,11)
#define CAN0_RXD_P2_12 A15X_MUX('2',12,11)
#define CAN0_TXD_P1_10 A15X_MUX('1',10,11)
#define CAN0_TXD_P1_2 A15X_MUX('1',2,11)
#define CAN0_TXD_P2_13 A15X_MUX('2',13,11)
#define CLKOUT_P0_6 A15X_MUX('0',6,12)
#define CMP1_OUT_P0_6 A15X_MUX('0',6,8)
#define CT0_MAT0_P0_16 A15X_MUX('0',16,4)
#define CT0_MAT1_P0_17 A15X_MUX('0',17,4)
#define CT0_MAT1_P2_13 A15X_MUX('2',13,5)
#define CT0_MAT2_P2_15 A15X_MUX('2',15,5)
#define CT0_MAT2_P3_30 A15X_MUX('3',30,4)
#define CT0_MAT3_P3_31 A15X_MUX('3',31,4)
#define CT1_MAT2_P2_6 A15X_MUX('2',6,5)
#define CT1_MAT2_P3_12 A15X_MUX('3',12,4)
#define CT1_MAT3_P3_13 A15X_MUX('3',13,4)
#define CT2_MAT0_P1_10 A15X_MUX('1',10,4)
#define CT2_MAT0_P2_0 A15X_MUX('2',0,5)
#define CT2_MAT1_P1_11 A15X_MUX('1',11,4)
#define CT2_MAT1_P2_1 A15X_MUX('2',1,5)
#define CT3_MAT1_P3_27 A15X_MUX('3',27,5)
#define CT3_MAT2_P3_28 A15X_MUX('3',28,5)
#define CT3_MAT3_P3_29 A15X_MUX('3',29,5)
#define CT4_MAT0_P2_12 A15X_MUX('2',12,4)
#define CT4_MAT1_P2_13 A15X_MUX('2',13,4)
#define CT4_MAT3_P2_15 A15X_MUX('2',15,4)
#define CT_INP16_P2_0 A15X_MUX('2',0,4)
#define CT_INP17_P2_1 A15X_MUX('2',1,4)
#define CT_INP18_P2_6 A15X_MUX('2',6,4)
#define CT_INP2_P0_6 A15X_MUX('0',6,4)
#define CT_INP6_P3_14 A15X_MUX('3',14,4)
#define FLEXIO0_D0_P0_0 A15X_MUX('0',0,6)
#define FLEXIO0_D0_P0_16 A15X_MUX('0',16,6)
#define FLEXIO0_D10_P1_2 A15X_MUX('1',2,6)
#define FLEXIO0_D10_P2_2 A15X_MUX('2',2,6)
#define FLEXIO0_D11_P1_3 A15X_MUX('1',3,6)
#define FLEXIO0_D11_P2_3 A15X_MUX('2',3,6)
#define FLEXIO0_D14_P2_6 A15X_MUX('2',6,6)
#define FLEXIO0_D15_P2_7 A15X_MUX('2',7,6)
#define FLEXIO0_D16_P1_8 A15X_MUX('1',8,6)
#define FLEXIO0_D16_P3_8 A15X_MUX('3',8,6)
#define FLEXIO0_D17_P1_9 A15X_MUX('1',9,6)
#define FLEXIO0_D17_P3_9 A15X_MUX('3',9,6)
#define FLEXIO0_D18_P1_10 A15X_MUX('1',10,6)
#define FLEXIO0_D18_P3_10 A15X_MUX('3',10,6)
#define FLEXIO0_D19_P1_11 A15X_MUX('1',11,6)
#define FLEXIO0_D19_P3_11 A15X_MUX('3',11,6)
#define FLEXIO0_D1_P0_1 A15X_MUX('0',1,6)
#define FLEXIO0_D1_P0_17 A15X_MUX('0',17,6)
#define FLEXIO0_D20_P2_12 A15X_MUX('2',12,6)
#define FLEXIO0_D20_P3_12 A15X_MUX('3',12,6)
#define FLEXIO0_D21_P2_13 A15X_MUX('2',13,6)
#define FLEXIO0_D21_P3_13 A15X_MUX('3',13,6)
#define FLEXIO0_D22_P3_14 A15X_MUX('3',14,6)
#define FLEXIO0_D23_P2_15 A15X_MUX('2',15,6)
#define FLEXIO0_D27_P3_27 A15X_MUX('3',27,6)
#define FLEXIO0_D28_P3_28 A15X_MUX('3',28,6)
#define FLEXIO0_D29_P3_29 A15X_MUX('3',29,6)
#define FLEXIO0_D2_P0_2 A15X_MUX('0',2,6)
#define FLEXIO0_D30_P1_30 A15X_MUX('1',30,6)
#define FLEXIO0_D30_P3_30 A15X_MUX('3',30,6)
#define FLEXIO0_D31_P1_31 A15X_MUX('1',31,6)
#define FLEXIO0_D31_P3_31 A15X_MUX('3',31,6)
#define FLEXIO0_D3_P0_3 A15X_MUX('0',3,6)
#define FLEXIO0_D6_P0_6 A15X_MUX('0',6,6)
#define FLEXIO0_D8_P1_0 A15X_MUX('1',0,6)
#define FLEXIO0_D8_P2_0 A15X_MUX('2',0,6)
#define FLEXIO0_D8_P3_0 A15X_MUX('3',0,6)
#define FLEXIO0_D9_P1_1 A15X_MUX('1',1,6)
#define FLEXIO0_D9_P2_1 A15X_MUX('2',1,6)
#define FLEXIO0_D9_P3_1 A15X_MUX('3',1,6)
#define FREQME_CLK_IN0_P1_8 A15X_MUX('1',8,1)
#define FREQME_CLK_IN1_P1_9 A15X_MUX('1',9,1)
#define I3C0_PUR_P1_11 A15X_MUX('1',11,10)
#define I3C0_SCL_P0_17 A15X_MUX('0',17,10)
#define I3C0_SDA_P0_16 A15X_MUX('0',16,10)
#define LPI2C0_HREQ_P0_6 A15X_MUX('0',6,2)
#define LPI2C0_SCL_P0_17 A15X_MUX('0',17,2)
#define LPI2C0_SDA_P0_16 A15X_MUX('0',16,2)
#define LPI2C1_SCLS_P1_3 A15X_MUX('1',3,3)
#define LPI2C1_SCL_P1_1 A15X_MUX('1',1,3)
#define LPI2C1_SDAS_P1_2 A15X_MUX('1',2,3)
#define LPI2C1_SDA_P1_0 A15X_MUX('1',0,3)
#define LPI2C2_SCLS_P1_11 A15X_MUX('1',11,3)
#define LPI2C2_SCL_P1_9 A15X_MUX('1',9,3)
#define LPI2C2_SDAS_P1_10 A15X_MUX('1',10,3)
#define LPI2C2_SDA_P1_8 A15X_MUX('1',8,3)
#define LPI2C3_HREQ_P3_29 A15X_MUX('3',29,2)
#define LPI2C3_SCLS_P3_30 A15X_MUX('3',30,2)
#define LPI2C3_SCL_P3_27 A15X_MUX('3',27,2)
#define LPI2C3_SDAS_P3_31 A15X_MUX('3',31,2)
#define LPI2C3_SDA_P3_28 A15X_MUX('3',28,2)
#define LPSPI0_PCS1_P0_6 A15X_MUX('0',6,3)
#define LPSPI0_PCS2_P0_16 A15X_MUX('0',16,3)
#define LPSPI0_PCS3_P0_17 A15X_MUX('0',17,3)
#define LPSPI1_PCS1_P2_6 A15X_MUX('2',6,2)
#define LPSPI1_SDI_P2_15 A15X_MUX('2',15,2)
#define LPSPI1_SDO_P2_13 A15X_MUX('2',13,2)
#define LPTMR0_ALT2_P3_31 A15X_MUX('3',31,0)
#define LPUART0_RXD_P2_0 A15X_MUX('2',0,2)
#define LPUART0_TXD_P2_1 A15X_MUX('2',1,2)
#define LPUART1_CTS_B_P1_11 A15X_MUX('1',11,2)
#define LPUART1_RTS_B_P1_10 A15X_MUX('1',10,2)
#define LPUART1_RTS_B_P2_15 A15X_MUX('2',15,3)
#define LPUART1_TXD_P2_13 A15X_MUX('2',13,3)
#define LPUART2_CTS_B_P3_13 A15X_MUX('3',13,2)
#define LPUART2_RTS_B_P3_12 A15X_MUX('3',12,2)
#define LPUART2_RXD_P3_14 A15X_MUX('3',14,2)
#define LPUART3_CTS_B_P3_14 A15X_MUX('3',14,3)
#define LPUART3_RXD_P3_0 A15X_MUX('3',0,3)
#define LPUART3_RXD_P3_13 A15X_MUX('3',13,3)
#define LPUART3_TXD_P3_1 A15X_MUX('3',1,3)
#define LPUART3_TXD_P3_12 A15X_MUX('3',12,3)
#define LPUART4_CTS_B_P2_0 A15X_MUX('2',0,3)
#define LPUART4_CTS_B_P3_31 A15X_MUX('3',31,3)
#define LPUART4_RTS_B_P2_1 A15X_MUX('2',1,3)
#define LPUART4_RTS_B_P3_30 A15X_MUX('3',30,3)
#define LPUART4_RXD_P2_6 A15X_MUX('2',6,3)
#define LPUART4_RXD_P3_28 A15X_MUX('3',28,3)
#define LPUART4_TXD_P2_7 A15X_MUX('2',7,3)
#define LPUART4_TXD_P3_27 A15X_MUX('3',27,3)
#define P0_16 A15X_MUX('0',16,0)
#define P0_17 A15X_MUX('0',17,0)
#define P0_6 A15X_MUX('0',6,0)
#define P1_10 A15X_MUX('1',10,0)
#define P1_11 A15X_MUX('1',11,0)
#define P2_0 A15X_MUX('2',0,0)
#define P2_1 A15X_MUX('2',1,0)
#define P2_13 A15X_MUX('2',13,0)
#define P2_15 A15X_MUX('2',15,0)
#define P2_6 A15X_MUX('2',6,0)
#define P3_12 A15X_MUX('3',12,0)
#define P3_13 A15X_MUX('3',13,0)
#define P3_14 A15X_MUX('3',14,0)
#define P3_30 A15X_MUX('3',30,0)
#define P3_31 A15X_MUX('3',31,0)
#define PWM0_X0_P3_12 A15X_MUX('3',12,5)
#define PWM0_X1_P3_13 A15X_MUX('3',13,5)
#define PWM0_X2_P3_14 A15X_MUX('3',14,5)
#define TRIG_IN10_P3_31 A15X_MUX('3',31,1)
#define TRIG_IN6_P2_0 A15X_MUX('2',0,1)
#define TRIG_IN7_P2_1 A15X_MUX('2',1,1)
#define TRIG_IN8_P2_13 A15X_MUX('2',13,1)
#define TRIG_OUT2_P1_11 A15X_MUX('1',11,1)
#define TRIG_OUT4_P2_15 A15X_MUX('2',15,1)
#define TRIG_OUT4_P2_6 A15X_MUX('2',6,1)
#define TRIG_OUT6_P3_30 A15X_MUX('3',30,1)
#define UTICK_CAP2_P0_16 A15X_MUX('0',16,5)
#define UTICK_CAP3_P0_17 A15X_MUX('0',17,5)
#define WUU0_IN11_P1_11 A15X_MUX('1',11,0)
#define WUU0_IN18_P2_0 A15X_MUX('2',0,0)
#define WUU0_IN25_P3_14 A15X_MUX('3',14,0)
#define WUU0_IN2_P0_16 A15X_MUX('0',16,0)
#define WUU0_IN30_P3_27 A15X_MUX('3',27,0)
#define WUU0_IN31_P0_6 A15X_MUX('0',6,8)

#endif /* _ZEPHYR_DTS_BINDING_MCXA146VFT_WRAPPER_ */
